



// 1.
let person1 = { name : '신연우' , city : 'Incheon' };
console.log( person1 );

// 2.
const book = {
  title: 'Cracking the Coding Interview',
  author: 'Gayle Laakmann McDowell',
  pages: 500
};
const values = ( Object.values( book) );
console.log( values );

for( index = 0 ; index<= values.length -1 ; index++){
    console.log(values[index]);
}

// 3.
const person = {
  name: '김코딩',
  age: 25,
};

person.email = 'asd123@123.com';

delete person.age;

console.log(person);

// 4.

const product = {
  name: '노트북',
  price: 1200000,
  stock: 50
};

console.log( product.price * product.stock );

// 5. 

const user = {
  name: '김코딩',
  'job-title': '개발자'
};
console.log( user["job-title"]  ); 

// 6.

const student = {
  name: '이학생',
  age: 25,
  address: {
    city: 'Seoul',
    zipCode: '12345'
  }
};

console.log(student.address.city);

// 7.

const character = {
  name: '전사',
  hp: 200,
  mp: 50
};

console.log( 'level' in character );

// 8.

const country = {
  name: '대한민국',
  capital: '서울',
  population: 51780000
};

console.log(Object.keys(country));
console.log(Object.values(country));

// 9. 

const inventory = {
  apple: 15,
  banana: 5,
  orange: 20,
  grape: 8
};
inventoryValues = Object.values(inventory);
inventoryA = Object.keys(inventory);


for(i = 0 ; i<=inventoryA.length-1 ; i++){
    if(inventoryValues[i] < 10){
        console.log(inventoryA[i]);
        continue;
    }
}



// 10.

const students = [
  { name: '김철수', major: '컴퓨터공학' },
  { name: '이영희', major: '경영학' },
  { name: '박지성', major: '체육교육' }
];

for(i = 0 ; i<= students.length -1 ; i++){
    console.log("이름 : " + students[i].name + " , 전공 : " + students[i].major );
}

// 11. 

let response = {"currentCount":22,"data":[{"데이터기준일자":"2025-01-31","동별":"부평1동","세대수":17196,"인구수(계)":34809,"인구수(남)":16671,"인구수(여)":18138},{"데이터기준일자":"2025-01-31","동별":"부평2동","세대수":7793,"인구수(계)":15326,"인구수(남)":7594,"인구수(여)":7732},{"데이터기준일자":"2025-01-31","동별":"부평3동","세대수":7381,"인구수(계)":14889,"인구수(남)":7379,"인구수(여)":7510},{"데이터기준일자":"2025-01-31","동별":"부평4동","세대수":17750,"인구수(계)":33475,"인구수(남)":16530,"인구수(여)":16945},{"데이터기준일자":"2025-01-31","동별":"부평5동","세대수":16357,"인구수(계)":33137,"인구수(남)":16287,"인구수(여)":16850},{"데이터기준일자":"2025-01-31","동별":"부평6동","세대수":8469,"인구수(계)":17339,"인구수(남)":8527,"인구수(여)":8812},{"데이터기준일자":"2025-01-31","동별":"산곡1동","세대수":6476,"인구수(계)":14753,"인구수(남)":7265,"인구수(여)":7488},{"데이터기준일자":"2025-01-31","동별":"산곡2동","세대수":10680,"인구수(계)":29107,"인구수(남)":14264,"인구수(여)":14843},{"데이터기준일자":"2025-01-31","동별":"산곡3동","세대수":8521,"인구수(계)":20016,"인구수(남)":9659,"인구수(여)":10357},{"데이터기준일자":"2025-01-31","동별":"산곡4동","세대수":6558,"인구수(계)":16457,"인구수(남)":7828,"인구수(여)":8629},{"데이터기준일자":"2025-01-31","동별":"청천1동","세대수":9678,"인구수(계)":22557,"인구수(남)":11446,"인구수(여)":11111},{"데이터기준일자":"2025-01-31","동별":"청천2동","세대수":14441,"인구수(계)":32868,"인구수(남)":16385,"인구수(여)":16483},{"데이터기준일자":"2025-01-31","동별":"갈산1동","세대수":6669,"인구수(계)":14299,"인구수(남)":7264,"인구수(여)":7035},{"데이터기준일자":"2025-01-31","동별":"갈산2동","세대수":8059,"인구수(계)":17320,"인구수(남)":8347,"인구수(여)":8973},{"데이터기준일자":"2025-01-31","동별":"삼산1동","세대수":14144,"인구수(계)":31979,"인구수(남)":15654,"인구수(여)":16325},{"데이터기준일자":"2025-01-31","동별":"삼산2동","세대수":10234,"인구수(계)":27290,"인구수(남)":13133,"인구수(여)":14157},{"데이터기준일자":"2025-01-31","동별":"부개1동","세대수":7662,"인구수(계)":15149,"인구수(남)":7565,"인구수(여)":7584},{"데이터기준일자":"2025-01-31","동별":"부개2동","세대수":8266,"인구수(계)":18864,"인구수(남)":9168,"인구수(여)":9696},{"데이터기준일자":"2025-01-31","동별":"부개3동","세대수":12055,"인구수(계)":27936,"인구수(남)":13325,"인구수(여)":14611},{"데이터기준일자":"2025-01-31","동별":"일신동","세대수":5018,"인구수(계)":11486,"인구수(남)":5783,"인구수(여)":5703},{"데이터기준일자":"2025-01-31","동별":"십정1동","세대수":11047,"인구수(계)":24100,"인구수(남)":12019,"인구수(여)":12081},{"데이터기준일자":"2025-01-31","동별":"십정2동","세대수":11099,"인구수(계)":20697,"인구수(남)":10726,"인구수(여)":9971}],"matchCount":22,"page":1,"perPage":22,"totalCount":22}
const data = response.data;
console.log( data );
let html = `<table><tr>
                        <th> 동별 </th> <th> 세대수 </th> <th> 인구수(계) </th>
                        <th> 인구수(남) </th> <th> 인구수(여) </th>
                    </tr>`

for( index =0 ; index <= data.length-1; index++){
    // index는 0부터 마지막 인덱스까지 1씩 증가
    const obj = data[index]; // index 번째의 객체(동별 인구정보) 호출
        console.log(obj);
    
    
    html += `<tr>
                <td> ${obj.동별 } </td> <td> ${obj.세대수 } </td> 
                <td> ${obj["인구수(계)"] } </td> 
                <td> ${obj["인구수(남)"] } </td> <td> ${obj["인구수(여)"] } </td>
            </tr>`
        
        
            //* (동별)객체별 속성 값 확인
        console.log(obj.동별);
        //* (세대수)객체별 속성 값 확인
        console.log(obj.세대수);
        console.log(obj["인구수(계)"]);
        console.log(obj["인구수(남)"]);
        console.log(obj["인구수(여)"]);
    
}
html += `</table>`
document.write(html);