

/* 

    조건문 : 특정 조건에 따라 명령을 순서대로 처리          <복잡한 코드> , 참/거짓 명령어에 선언식 가능
        형태1) 
            if (조건){ 참일 때 코드; }
        형태2)
            if (조건){ 참일 때 코드; }
            else{ 거짓일 때 코드; }

        형태3)
            if (조건){ 참일 때 코드; }
            else if{ 조건2 } { 참2일 때 코드; }
            else{ 거짓일 때 코드; }
        형태4)
            if (조건){
                if(조건) { }
                else{ }
            }else{ }


    삼항연산자 : 특정 조건에 따라 명령을 순서대로 처리      <단순한 코드> , 참/거짓 명령어에 선언식 불가능
        형태) 조건 ? 참일때 코드 : 거짓일 때 코드



*/